NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_bearer_adv.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "prov_bearer_adv.h"
#include "nrf_mesh_prov.h"
#include "log.h"

#include <cmock.h>
#include <unity.h>

#include "advertiser_mock.h"
#include "provisioning_mock.h"
#include "timer_scheduler_mock.h"
#include "rand_mock.h"
#include "prov_beacon_mock.h"
#include "nrf_mesh_mock.h"
#include "nrf_mesh_configure_mock.h"
#include "timer_mock.h"
#include "bearer_event_mock.h"
#include "utils.h"

#include "test_assert.h"
#include "utils.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

/* Transaction start values for each role (from Mesh Profile Specification v1.0, section 5.2.1) */
#define PROVISIONER_TRANSACTION_START_VALUE 0
#define PROVISIONEE_TRANSACTION_START_VALUE 0x80

#define BLE_ADV_OVERHEAD (BLE_GAP_ADDR_LEN + sizeof(ble_ad_data_t) /* length field and AD Type*/)
#define PROV_ADV_OVERHEAD (sizeof(ble_ad_data_t) + 4 /*link ID*/ + 1 /* transaction no*/)
/** The largest provisioning PDU length (copied from Mesh Profile Specification v1.0, table 5.3: 64 byte payload + 1 for pdu type). */
#define PROV_PAYLOAD_MAX_LENGTH  65
#define PROV_LINK_OPEN_DATA_SIZE 17
#define PROV_LINK_ACK_DATA_SIZE 1
#define PROV_LINK_CLOSE_DATA_SIZE 2
#define PROV_TRANS_ACK_DATA_SIZE 1
/** The largest payload length in a single provisioning data packet see Table 5.2 in Mesh Profile Specification v1.0 */
#define GENERIC_PROV_PDU_MAX_LEN 24
/** Max see Figure 5.3 in Mesh Profile Specification v1.0 */
#define PROV_START_PDU_HEADER_SIZE (1 /*SegN | GPCF */ + 2 /*Total length */ + 1 /* FCS */)
#define PROV_START_PDU_PAYLOAD_MAX_LEN (GENERIC_PROV_PDU_MAX_LEN - PROV_START_PDU_HEADER_SIZE)
/** Max see Figure 5.5 in Mesh Profile Specification v1.0 */
#define PROV_CONTINUE_PDU_HEADER_SIZE (1 /*SegN | GPCF */)
#define PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN (GENERIC_PROV_PDU_MAX_LEN - PROV_CONTINUE_PDU_HEADER_SIZE)

#define PROV_LINK_OPEN_OPCODE_WITH_GPCF_FIELD   (3)
#define PROV_LINK_ACK_OPCODE_WITH_GPCF_FIELD    ((1<<2) | 3)
#define PROV_LINK_CLOSE_OPCODE_WITH_GPCF_FIELD  ((2<<2) | 3)
#define PROV_TRANS_ACK_OPCODE_WITH_GPCF_FIELD   (1)
#define PROV_TRANS_START_OPCODE_WITH_GPCF_FIELD (0)
#define PROV_TRANS_CONTINUE_OPCODE_WITH_GPCF_FIELD  (2)

#define PROV_BEARER_ADV_UNACKED_REPEAT_COUNT    (4)

/** Flag the module should use to trigger async callback. */
#define ASYNC_FLAG  0xF1A6F1A6

static adv_packet_t m_packet;

#define ALLOC_AND_TX(P_ADV, ALLOC_SIZE, SUCCESS)                                                \
do                                                                                              \
{                                                                                               \
    advertiser_packet_alloc_ExpectAndReturn(P_ADV, ALLOC_SIZE, (SUCCESS) ? &m_packet : NULL);   \
    if (SUCCESS)                                                                                \
    {                                                                                           \
        advertiser_packet_send_Expect(P_ADV, &m_packet);                                        \
    }                                                                                           \
}                                                                                               \
while (0)

static uint8_t data[PROV_PAYLOAD_MAX_LENGTH+1];
static uint8_t uuid1[NRF_MESH_UUID_SIZE] = {0,1,2,3};
static uint8_t uuid2[NRF_MESH_UUID_SIZE] = {9,10,11,12};
static uint8_t link_open_payload[PROV_ADV_OVERHEAD + PROV_LINK_OPEN_DATA_SIZE];
static uint8_t link_ack_payload[PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE];
static uint8_t link_close_payload[PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE];
static uint8_t trans_data_payload[PROV_ADV_OVERHEAD + GENERIC_PROV_PDU_MAX_LEN];
static uint8_t trans_ack_payload[PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE];
static uint8_t minimal_payload[PROV_ADV_OVERHEAD + 1];

static prov_bearer_if_tx_t           prov_bearer_adv_tx;
static prov_bearer_if_listen_start_t prov_bearer_adv_listen;
static prov_bearer_if_listen_stop_t  prov_bearer_adv_listen_stop;
static prov_bearer_if_link_open_t    prov_bearer_adv_link_open;
static prov_bearer_if_link_close_t   prov_bearer_adv_link_close;

static nrf_mesh_rx_metadata_t m_dummy_metadata;

static advertiser_tx_complete_cb_t m_tx_complete_cb;
static bearer_event_flag_callback_t m_async_cb;


static struct
{
    advertiser_t * p_advertiser;
    uint8_t * p_adv_buf;
    uint32_t adv_buf_size;
    uint32_t calls;
} m_expected_adv_init;

