NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_bearer_adv.c
static ble_ad_data_t * get_link_open_packet(uint8_t * p_uuid)
{
    link_open_payload[PROV_ADV_OVERHEAD] = PROV_LINK_OPEN_OPCODE_WITH_GPCF_FIELD;
    memcpy(&link_open_payload[PROV_ADV_OVERHEAD+1], p_uuid, NRF_MESH_UUID_SIZE);

    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) link_open_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_LINK_OPEN_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_link_ack_packet(void)
{
    link_ack_payload[PROV_ADV_OVERHEAD] = PROV_LINK_ACK_OPCODE_WITH_GPCF_FIELD;
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) link_ack_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_LINK_ACK_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_link_close_packet(nrf_mesh_prov_link_close_reason_t close_reason)
{
    link_close_payload[PROV_ADV_OVERHEAD] = PROV_LINK_CLOSE_OPCODE_WITH_GPCF_FIELD;
    link_close_payload[PROV_ADV_OVERHEAD+1] = (uint8_t)close_reason;

    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) link_close_payload;
    p_ad_data->length = 1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_LINK_CLOSE_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static void rx_link_open(prov_bearer_t * p_bearer, uint8_t * p_uuid, uint32_t link_id, bool accept)
{
    nrf_mesh_prov_bearer_adv_t * p_bearer_adv = PARENT_BY_FIELD_GET(nrf_mesh_prov_bearer_adv_t, prov_bearer, p_bearer);
    ble_ad_data_t *  p_ad_data  = get_link_open_packet(p_uuid);
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        advertiser_interval_set_Expect(&p_bearer_adv->advertiser, BEARER_ADV_INT_DEFAULT_MS);
        ALLOC_AND_TX(&p_bearer_adv->advertiser, PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE, true);
        prov_cb_link_opened_Expect(p_bearer);
        timer_now_ExpectAndReturn(1000);
        timer_sch_reschedule_Expect(&p_bearer_adv->link_timeout_event, 1000 + p_bearer_adv->link_timeout);
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    if (accept)
    {
        TEST_ASSERT_EQUAL(1, m_packet.config.repeats);
    }
}

static void rx_link_ack(prov_bearer_t * p_bearer, uint32_t link_id, bool accept)
{
    nrf_mesh_prov_bearer_adv_t * p_bearer_adv = PARENT_BY_FIELD_GET(nrf_mesh_prov_bearer_adv_t, prov_bearer, p_bearer);
    ble_ad_data_t * p_ad_data  = get_link_ack_packet();
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        advertiser_flush_Expect(&p_bearer_adv->advertiser);
        advertiser_interval_set_Expect(&p_bearer_adv->advertiser, BEARER_ADV_INT_DEFAULT_MS);
        prov_cb_link_opened_Expect(p_bearer);
        timer_now_ExpectAndReturn(1000);
        timer_sch_reschedule_Expect(&p_bearer_adv->link_timeout_event, 1000 + p_bearer_adv->link_timeout);
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
}

static void rx_link_close(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason, uint32_t link_id,  bool accept)
{
    nrf_mesh_prov_bearer_adv_t * p_bearer_adv = PARENT_BY_FIELD_GET(nrf_mesh_prov_bearer_adv_t, prov_bearer, p_bearer);
    ble_ad_data_t * p_ad_data  = get_link_close_packet(close_reason);
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        timer_sch_abort_Expect(&p_bearer_adv->link_timeout_event);
        prov_cb_link_closed_Expect(p_bearer, close_reason);
        advertiser_flush_Expect(&p_bearer_adv->advertiser);
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
}

static void tx_link_open(prov_bearer_t * p_bearer, uint8_t * p_uuid, uint32_t link_id)
{
    nrf_mesh_prov_bearer_adv_t * p_bearer_adv = PARENT_BY_FIELD_GET(nrf_mesh_prov_bearer_adv_t, prov_bearer, p_bearer);
    p_bearer_adv->link_id = link_id;
    p_bearer_adv->link_timeout = 1000;
    p_bearer_adv->p_next = NULL;

    ALLOC_AND_TX(&p_bearer_adv->advertiser, PROV_ADV_OVERHEAD + PROV_LINK_OPEN_DATA_SIZE, true);

    if (p_bearer_adv->instance_state != PROV_BEARER_ADV_INSTANCE_INITIALIZED)
    {
        advertiser_instance_init_ExpectStub(&p_bearer_adv->advertiser, p_bearer_adv->tx_buffer, sizeof(p_bearer_adv->tx_buffer));
    }

    rand_hw_rng_get_Expect((uint8_t*) &p_bearer_adv->link_id, sizeof(p_bearer_adv->link_id));
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(&p_bearer_adv->link_timeout_event, 1000 + NRF_MESH_PROV_LINK_TIMEOUT_MIN_US);
    advertiser_enable_Expect(&p_bearer_adv->advertiser);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, prov_bearer_adv_link_open(p_bearer, p_uuid, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));
    TEST_ASSERT_EQUAL(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT, m_packet.config.repeats);
}

static void tx_link_close(prov_bearer_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason)
{
    nrf_mesh_prov_bearer_adv_t * p_bearer_adv = PARENT_BY_FIELD_GET(nrf_mesh_prov_bearer_adv_t, prov_bearer, p_bearer);
    ALLOC_AND_TX(&p_bearer_adv->advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, true);
    prov_bearer_adv_link_close(p_bearer, close_reason);
    TEST_ASSERT_EQUAL(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT, m_packet.config.repeats);

    /* Send queue empty in order to move on to link closed state */
    advertiser_flush_Expect(&p_bearer_adv->advertiser);
    prov_cb_link_closed_Expect(p_bearer, close_reason);
    timer_sch_abort_Expect(&p_bearer_adv->link_timeout_event);
    p_bearer_adv->queue_empty_pending = true;
    TEST_ASSERT_NOT_NULL(m_async_cb);
    m_async_cb();
}

static void listen_start(prov_bearer_t * p_bearer)
{
    nrf_mesh_prov_bearer_adv_t * p_bearer_adv = PARENT_BY_FIELD_GET(nrf_mesh_prov_bearer_adv_t, prov_bearer, p_bearer);
    if (p_bearer_adv->instance_state != PROV_BEARER_ADV_INSTANCE_INITIALIZED)
    {
        advertiser_instance_init_ExpectStub(&p_bearer_adv->advertiser, p_bearer_adv->tx_buffer, sizeof(p_bearer_adv->tx_buffer));
    }

    advertiser_enable_Expect(&p_bearer_adv->advertiser);
    prov_beacon_unprov_build_ExpectAndReturn(&p_bearer_adv->advertiser, NULL, 0, &m_packet);
    advertiser_interval_set_Expect(&p_bearer_adv->advertiser, NRF_MESH_UNPROV_BEACON_INTERVAL_MS);
    advertiser_packet_send_Expect(&p_bearer_adv->advertiser, &m_packet);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, prov_bearer_adv_listen(p_bearer, NULL, 0, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));
    TEST_ASSERT_EQUAL(ADVERTISER_REPEAT_INFINITE, m_packet.config.repeats);
}

