NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_bearer_adv.c
    if (bearer_adv.instance_state != PROV_BEARER_ADV_INSTANCE_INITIALIZED)
    {
        advertiser_instance_init_ExpectStub(&bearer_adv.advertiser, bearer_adv.tx_buffer, sizeof(bearer_adv.tx_buffer));
    }

    rand_hw_rng_get_Expect((uint8_t*) &bearer_adv.link_id, sizeof(bearer_adv.link_id));
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_OPEN_DATA_SIZE, false);
    TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, prov_bearer_adv_link_open(&bearer_adv.prov_bearer, uuid1, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));


    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* Link ACK */
    rx_link_ack(&bearer_adv.prov_bearer, link_id, true);
    /* Invalid link open tx*/
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_link_open(&bearer_adv.prov_bearer, uuid1, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));
    /* Invalid listen stop call*/
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_listen_stop(&bearer_adv.prov_bearer));
    /* Invalid Link ACK */
    rx_link_ack(&bearer_adv.prov_bearer, link_id, false);
    /* Valid Link Close packet but different link id*/
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT, link_id + 1, false);
    /* Link CLOSE */
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT, link_id, true);
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* A call to the prov_bearer_adv_link_close shall not fail, so if one of the external modules lets us down
       we close without sending and immediately do a callback to the module above.
       *** Technically, this is illegal behaviour, perhaps we need a timer to retry closing? ***/
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, false);
    advertiser_flush_Expect(&bearer_adv.advertiser);
    prov_cb_link_closed_Expect(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT);
    timer_sch_abort_Expect(&bearer_adv.link_timeout_event);
    prov_bearer_adv_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT);

    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* Close link */
    tx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT);
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* Close link */
    tx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR);
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* RX a packet with LINK_CLOSE command, expect a callback. */
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_ERROR, link_id, true);
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* RX of unknown close command is acceptable, and this should be forwarded. */
    rx_link_close(&bearer_adv.prov_bearer, (nrf_mesh_prov_link_close_reason_t) 0xff, link_id, true);
    /* Close link with unknown close command is not acceptable, assert */
    TEST_NRF_MESH_ASSERT_EXPECT(prov_bearer_adv_link_close(&bearer_adv.prov_bearer, (nrf_mesh_prov_link_close_reason_t) 0xff));
}

void test_link_establish_passive(void)
{
    /* Make bearer static so linked list internally won't be corrupted across tests. */
    static nrf_mesh_prov_bearer_adv_t bearer_adv;
    setup_interface(&bearer_adv);

    uint32_t link_id = 0xFFFFFFFF;

    /* Start listenining. */
    listen_start(&bearer_adv.prov_bearer);
    /* Ignore if by chance we match a close link request to the dummy link_id of 0. */
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, 0, false);
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_listen(&bearer_adv.prov_bearer, NULL, 0, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));
    listen_stop(&bearer_adv.prov_bearer);
    listen_start(&bearer_adv.prov_bearer);

    /* RX a packet with LINK_CLOSE command, do not expect a link closed callback*/
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, false);

    /* Send a packet with the LINK_OPEN opcode but no uuid, should be ignored. */
    minimal_payload[PROV_ADV_OVERHEAD] = PROV_LINK_OPEN_OPCODE_WITH_GPCF_FIELD;
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) minimal_payload;
    p_ad_data->length = 1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + 1;
    p_ad_data->type = AD_TYPE_PB_ADV;
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);

    /* Send a control packet with the unknown opcode, should be ignored:*/
    minimal_payload[PROV_ADV_OVERHEAD] = 0xFF;
    p_ad_data = (ble_ad_data_t *) minimal_payload;
    p_ad_data->length = 1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + 1;
    p_ad_data->type = AD_TYPE_PB_ADV;
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);

    /* RX a packet with LINK_OPEN command using wrong uuid*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid2, link_id, false);

    /* Fail RX of a packet with LINK_OPEN command due to PACKET MANAGER*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    advertiser_interval_set_Expect(&bearer_adv.advertiser, BEARER_ADV_INT_DEFAULT_MS);
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE, false);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, false);

    /* State shouldn't have changed due to the failures, so a successful RX should be possible: */

    /* RX a packet with LINK_OPEN command*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, true);

    /* Sending another link open should produce an ack without the callback to higher layers */
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE, true);
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, false);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);


    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_listen(&bearer_adv.prov_bearer, NULL, 0, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_link_open(&bearer_adv.prov_bearer, uuid1, NRF_MESH_PROV_LINK_TIMEOUT_MIN_US));

