NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_bearer_adv.c
    /* RX a packet with LINK_CLOSE command, expect a callback*/
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);

    /* RX a packet with LINK_OPEN command, do not expect a link opened callback*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, false);
}

void test_multiple_bearer(void)
{
    /* Make bearer static so linked list internally won't be corrupted across tests. */
    static nrf_mesh_prov_bearer_adv_t bearer1;
    static nrf_mesh_prov_bearer_adv_t bearer2;
    static nrf_mesh_prov_bearer_adv_t bearer3;
    static nrf_mesh_prov_bearer_adv_t bearer4;

    setup_interface(&bearer1);
    setup_interface(&bearer2);
    setup_interface(&bearer3);
    setup_interface(&bearer4);

    uint32_t link_id1 = 0x1;
    uint32_t link_id2 = 0x10;
    uint32_t link_id3 = 0x100;
    uint32_t link_id4 = 0x1000;

    /** Test out of order connection establishment (both as provisioner and provisionee). */
    /* Start listenining on bearer 1. */
    listen_start(&bearer1.prov_bearer);
    /* Open link 2. */
    tx_link_open(&bearer2.prov_bearer, uuid2, link_id2);
    /* Open link 3. */
    tx_link_open(&bearer3.prov_bearer, uuid1, link_id3);
    /* Stop listening on bearer1 before listening on bearer4 (out of order listening is not allowed)*/
    /* Stopping bearer 1 after taking action with bearer 2 and 3 in order to test remove_active_bearer
       function in prov_bearer_adv.c */
    listen_stop(&bearer1.prov_bearer);
    /* Start listenining on bearer 4. */
    listen_start(&bearer4.prov_bearer);
    /* Send link open on bearer1: doing this after starting to listen on bearer 4 in order to test
       get_bearer_from_state  function in prov_bearer_adv.c */
    tx_link_open(&bearer1.prov_bearer, uuid2, link_id1);

    /* LINK_OPEN for bearer4*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer4.prov_bearer, uuid1, link_id4, true);
    /* Link ACK for bearer 1, 2 and 3*/
    rx_link_ack(&bearer3.prov_bearer, link_id3, true);
    /* Link ACK */
    rx_link_ack(&bearer1.prov_bearer, link_id1, true);
    /* Link ACK */
    rx_link_ack(&bearer2.prov_bearer, link_id2, true);

    rx_link_close(&bearer1.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id1, true);
    rx_link_close(&bearer2.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id2, true);
    rx_link_close(&bearer3.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id3, true);
    rx_link_close(&bearer4.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id4, true);
}

void test_packet_send(void)
{
    /* Make bearer static so linked list internally won't be corrupted across tests. */
    static nrf_mesh_prov_bearer_adv_t bearer_adv;
    setup_interface(&bearer_adv);

    uint32_t link_id = 0;
    uint8_t curr_transcation = PROVISIONER_TRANSACTION_START_VALUE;
    /* Can't send data until a link is established*/
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_tx(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH));

    /** Establish a connection **/
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* Link ACK */
    rx_link_ack(&bearer_adv.prov_bearer, link_id, true);

    /* Can't send data larger than PROV_PAYLOAD_MAX_LENGTH */
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, prov_bearer_adv_tx(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH+1));

    /* Send 1 byte long data */
    uint8_t no_segments = send_data_packet(&bearer_adv.prov_bearer, data, 1);
    /* transcation no starts with 0 when in provisioner role (section 5.2.1 in Mesh Profile Specification v1.0) */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(1, no_segments);
    /* Can't send data without receiving an ack or timeout for the previous one*/
    TEST_ASSERT_EQUAL(NRF_ERROR_BUSY, prov_bearer_adv_tx(&bearer_adv.prov_bearer, data, 1));
    /* Send in an ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;

    /* Send the largest packet that can fit into a single segment. */
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(1, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;

    /* Send a large enough packet to split it in two with only 1 byte in the continue packet. */
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN + 1);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(2, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;

    /* Send a large packet that barely fits two packets*/
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(2, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;

    /* Send a large enough packet to split it in three with only 1 byte in the last continue packet. */
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN + 1);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;

    /* Send the largest possible data packet */
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* No ack, send a timeout */
    (void) send_data_packet_internals(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH);
    bearer_adv.timeout_event.cb(0, &bearer_adv);
    /* Transcation no must remain the same */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* Send in an ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);

    /* Close link*/
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);
}

void test_packet_send_abnormal(void)
{
    /* Make bearer static so linked list internally won't be corrupted across tests. */
    static nrf_mesh_prov_bearer_adv_t bearer_adv;
    setup_interface(&bearer_adv);

    uint32_t link_id = 0x12345678;
    uint8_t curr_transcation = PROVISIONEE_TRANSACTION_START_VALUE;
    /* Can't send data until a link is established*/
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_tx(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH));

    /* Start listenining. */
    listen_start(&bearer_adv.prov_bearer);
    /* LINK_OPEN */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, true);

