NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_bearer_adv.c
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    uint8_t no_segments = send_data_packet(&bearer_adv.prov_bearer, data, 1);
    TEST_ASSERT_EQUAL(1, no_segments);

    /* Send in ack with wrong transcation value, it should be ignored */
    ble_ad_data_t * p_ack_packet = get_transaction_ack_packet(curr_transcation-1);
    prov_bearer_adv_packet_in(p_ack_packet->data, p_ack_packet->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    /* LINK_OPEN and LINK_ACK control messages should also be ignored */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, false);
    rx_link_ack(&bearer_adv.prov_bearer, link_id, false);
    /* Send in an ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);
    curr_transcation++;
    /* Ignore if not expecting an ack */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, false);

    /* Send the largest possible data packet */
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* No ACK */
    /* Time out cb when the link time out has passed: this should produce a LINK_CLOSE message*/
    /* First attempt to TX fails*/
    timestamp_t timeout_timestamp = bearer_adv.sar_timeout + 1;
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, false);
    bearer_adv.timeout_event.cb(bearer_adv.sar_timeout + 1, &bearer_adv);

    /* timeout interval should be larger than 0 */
    TEST_ASSERT(bearer_adv.timeout_event.interval > 0);
    /* Timeout value should be updated to NOW to ensure a timeout trigger for the next retry cb. */
    TEST_ASSERT_EQUAL(timeout_timestamp, bearer_adv.sar_timeout);
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, true);
    bearer_adv.timeout_event.cb(bearer_adv.sar_timeout+1, &bearer_adv);
    TEST_ASSERT_EQUAL(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT, m_packet.config.repeats);

    /* Send queue empty in order to move on to link closed state */
    timer_sch_abort_Expect(&bearer_adv.timeout_event);
    advertiser_flush_Expect(&bearer_adv.advertiser);
    prov_cb_link_closed_Expect(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT);
    timer_sch_abort_Expect(&bearer_adv.link_timeout_event);
    bearer_adv.queue_empty_pending = true;
    TEST_ASSERT_NOT_NULL(m_async_cb);
    m_async_cb();
    /* Receive a link close when in TX state */
    /* Start listenining. */
    listen_start(&bearer_adv.prov_bearer);
    /* LINK_OPEN */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer_adv.prov_bearer, uuid1, link_id, true);
    no_segments = send_data_packet(&bearer_adv.prov_bearer, data, 1);
    TEST_ASSERT_EQUAL(1, no_segments);
    /* Close link*/
    timer_sch_abort_Expect(&bearer_adv.timeout_event);
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);
}

void test_packet_receive(void)
{
    /* Make bearer static so linked list internally won't be corrupted across tests. */
    static nrf_mesh_prov_bearer_adv_t bearer_adv;
    setup_interface(&bearer_adv);

    uint32_t link_id = 0xDAFA;
    uint8_t curr_transcation = PROVISIONEE_TRANSACTION_START_VALUE;
    /** Establish a connection **/
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* Link ACK */
    rx_link_ack(&bearer_adv.prov_bearer, link_id, true);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);

    /* Send the largest packet that can fit into a single segment. */
    receive_data(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);

    /* Send a large enough packet to split it in two with only 1 byte in the continue packet. */
    receive_data(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN + 1, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);

    /* Send a large packet that barely fits two packets*/
    receive_data(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);

    /* Send a large enough packet to split it in three with only 1 byte in the last continue packet. */
    receive_data(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN + 1, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);

    /* Send the largest possible data packet */
    receive_data(&bearer_adv.prov_bearer, data, PROV_PAYLOAD_MAX_LENGTH, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);

    /* Bump up the transaction number to a near wrap_around*/
    bearer_adv.transaction_in = 0xFF;
    curr_transcation = 0xFF;
    receive_data(&bearer_adv.prov_bearer, data, PROV_START_PDU_PAYLOAD_MAX_LEN, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer_adv.transaction_in);
    /* Re send the old packet after the wrap around and expect a response but no callback!*/
    ALLOC_AND_TX(&bearer_adv.advertiser, PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE, true);
    prov_cb_pkt_in_Expect(&bearer_adv.prov_bearer, data, 1);
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(&bearer_adv.link_timeout_event, 1000 + bearer_adv.link_timeout);
    ble_ad_data_t * p_ad_data = get_transaction_start_packet(data, 1, curr_transcation);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);
    TEST_ASSERT_EQUAL(curr_transcation+1, bearer_adv.transaction_in);

