NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_prov_bearer_adv.c
    const uint8_t sample_data_8_7_12[] =
    {
        0x07, 0xd0, 0xbd, 0x7f, 0x4a, 0x89, 0xa2, 0xff, 0x62, 0x22, 0xaf, 0x59, 0xa9, 0x0a, 0x60, 0xad,
        0x58, 0xac, 0xfe, 0x31, 0x23, 0x35, 0x6f, 0x5c, 0xec, 0x29, 0x73, 0xe0, 0xec, 0x50, 0x78, 0x3b,
        0x10, 0xc7
    };
    TEST_ASSERT_EQUAL(0x8B, calculate_3GPP_CRC(sample_data_8_7_12, sizeof(sample_data_8_7_12)));

    const uint8_t sample_data_8_7_13[] = {0x08};
    TEST_ASSERT_EQUAL(0x3E, calculate_3GPP_CRC(sample_data_8_7_13, sizeof(sample_data_8_7_13)));
}

void test_tx_complete(void)
{
    /* Make bearer static so linked list internally won't be corrupted across tests. */
    static nrf_mesh_prov_bearer_adv_t bearer_adv;
    setup_interface(&bearer_adv);

    prov_bearer_t * p_bearer = nrf_mesh_prov_bearer_adv_interface_get(&bearer_adv);
    prov_bearer_adv_tx = p_bearer->p_interface->tx;
    prov_bearer_adv_listen = p_bearer->p_interface->listen_start;
    prov_bearer_adv_listen_stop = p_bearer->p_interface->listen_stop;
    prov_bearer_adv_link_open = p_bearer->p_interface->link_open;
    prov_bearer_adv_link_close = p_bearer->p_interface->link_close;

    p_bearer->p_parent = PARENT_POINTER;
    p_bearer->p_callbacks = &m_callbacks;
    uint32_t link_id = 0;

    /** Establish a connection **/
    /* Open link. */
    tx_link_open(&bearer_adv.prov_bearer, uuid1, link_id);
    /* Sent one packet: */
    TEST_ASSERT_EQUAL(1, bearer_adv.last_token);

    TEST_ASSERT_NOT_NULL(m_tx_complete_cb);
    bearer_event_flag_set_Expect(ASYNC_FLAG);
    m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);
    TEST_ASSERT_TRUE(bearer_adv.queue_empty_pending);

    TEST_ASSERT_NOT_NULL(m_async_cb);
    m_async_cb();
    TEST_ASSERT_FALSE(bearer_adv.queue_empty_pending);

    rx_link_ack(&bearer_adv.prov_bearer, link_id, true);

    /* Send 3 segment data */
    uint32_t old_last_token = bearer_adv.last_token;
    uint8_t no_segments = send_data_packet(&bearer_adv.prov_bearer, data, PROV_PDU_MAX_LENGTH);
    TEST_ASSERT_EQUAL(3, no_segments);
    TEST_ASSERT_EQUAL(old_last_token + 3, bearer_adv.last_token);
    for (uint32_t i = 0; i < 2; ++i)
    {
        /* The token increase once per TX, mirror these tokens to mimic tx complete on each packet. */
        m_packet.token = old_last_token + 1 + i;
        m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);
        TEST_ASSERT_FALSE(bearer_adv.queue_empty_pending);
    }
    bearer_event_flag_set_Expect(ASYNC_FLAG);
    m_packet.token = bearer_adv.last_token;
    m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);
    TEST_ASSERT_TRUE(bearer_adv.queue_empty_pending);

    /* Receive an ack on the data packet so we can proceed the test */
    receive_data_ack(&bearer_adv.prov_bearer, link_id, true);

    /* Close the link to remove the internal reference to the bearer. */
    rx_link_close(&bearer_adv.prov_bearer, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);

    /* Start listenining. */
    listen_start(&bearer_adv.prov_bearer);
    /* Should not mark the beacon as a pending tx packet (token should stay at initial value). */
    TEST_ASSERT_EQUAL(0, bearer_adv.last_token);
    bearer_adv.queue_empty_pending = false;

    nrf_mesh_prov_bearer_adv_t bearer_copy = bearer_adv;
    setup_interface(&bearer_copy);
    /* We'll get a TX complete callback for every transmitted beacon, but should
     * ignore them all. */
    m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);
    m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);
    m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);
    m_tx_complete_cb(&bearer_adv.advertiser, m_packet.token, 0);

    TEST_ASSERT_EQUAL_MEMORY(&bearer_copy, &bearer_adv, sizeof(bearer_adv));

    /* Getting an unprompted async process call shouldn't do anything */
    m_async_cb();
    TEST_ASSERT_EQUAL_MEMORY(&bearer_copy, &bearer_adv, sizeof(bearer_adv));
}
